Revit 2024 API
HermiteFace.Tangents Property
Tangents of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<XYZ> this[
	int index
] { get; }
Visual Basic
Public ReadOnly Property Tangents ( _
	index As Integer _
) As IList(Of XYZ)
	Get
Visual C++
public:
property IList<XYZ^>^ Tangents[int index] {
	IList<XYZ^>^ get (int index);
}
Parameters
index
Type: System.Int32
See Also
HermiteFace Class
Autodesk.Revit.DB Namespace